<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Cook;

class CookSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $cooks = [
            [
                'id' => '1',
                'name' => 'Кекс',
                'coef' => '1',
            ],
            [
                'id' => '5',
                'name' => 'Кулич',
                'coef' => '1',
            ],
            [
                'id' => '6',
                'name' => 'Краффин',
                'coef' => '1',
            ],
            [
                'id' => '8',
                'name' => 'Салат Цезарь',
                'coef' => '1',
            ],
            [
                'id' => '9',
                'name' => 'Шарлотка',
                'coef' => '1',
            ],
            [
                'id' => '10',
                'name' => 'Манник',
                'coef' => '1',
            ],
            [
                'id' => '11',
                'name' => 'Запеканка',
                'coef' => '0.7',
            ],
            [
                'id' => '12',
                'name' => 'Варенье',
                'coef' => '1.3',
            ],
            [
                'id' => '13',
                'name' => 'Голубцы',
                'coef' => '1',
            ],
            [
                'id' => '14',
                'name' => 'Отбивные',
                'coef' => '1',
            ],
            [
                'id' => '15',
                'name' => 'Желе',
                'coef' => '0.7',
            ],
            [
                'id' => '16',
                'name' => 'Салат Греческий',
                'coef' => '1',
            ],
            [
                'id' => '17',
                'name' => 'Оладьи',
                'coef' => '0.8',
            ],
            [
                'id' => '18',
                'name' => 'Мороженое',
                'coef' => '1.7',
            ],
            [
                'id' => '19',
                'name' => 'Меренговый рулет',
                'coef' => '1',
            ],
            [
                'id' => '20',
                'name' => 'Рассольник',
                'coef' => '0.8',
            ],
            [
                'id' => '21',
                'name' => 'Салат',
                'coef' => '0.8',
            ],
            [
                'id' => '22',
                'name' => 'Джем',
                'coef' => '0.7',
            ],
            [
                'id' => '23',
                'name' => 'Ленивые голубцы',
                'coef' => '1',
            ],
            [
                'id' => '24',
                'name' => 'Блины',
                'coef' => '1.4',
            ],
            [
                'id' => '25',
                'name' => 'Рыба',
                'coef' => '1',
            ],
            [
                'id' => '26',
                'name' => 'Овощи',
                'coef' => '1',
            ],
            [
                'id' => '27',
                'name' => 'Стрелки чеснока',
                'coef' => '1',
            ],
            [
                'id' => '28',
                'name' => 'Чизкейк',
                'coef' => '1',
            ],
            [
                'id' => '29',
                'name' => 'Лазанья',
                'coef' => '1',
            ],
            [
                'id' => '30',
                'name' => 'Хачапури',
                'coef' => '1',
            ],
            [
                'id' => '31',
                'name' => 'Бисквит',
                'coef' => '1',
            ],
            [
                'id' => '32',
                'name' => 'Рулет',
                'coef' => '1',
            ],
            [
                'id' => '33',
                'name' => 'Медовик',
                'coef' => '1',
            ],
            [
                'id' => '34',
                'name' => 'Жульен',
                'coef' => '1',
            ],
            [
                'id' => '35',
                'name' => 'Повидло',
                'coef' => '1.3',
            ],
            [
                'id' => '36',
                'name' => 'Фунчоза',
                'coef' => '1',
            ],
            [
                'id' => '37',
                'name' => 'Пирог',
                'coef' => '1',
            ],
            [
                'id' => '38',
                'name' => 'Ткемали',
                'coef' => '0.7',
            ],
            [
                'id' => '39',
                'name' => 'Свекольник',
                'coef' => '1',
            ],
            [
                'id' => '40',
                'name' => 'Компот',
                'coef' => '0.3',
            ],
            [
                'id' => '41',
                'name' => 'Суп',
                'coef' => '0.36',
            ],
            [
                'id' => '42',
                'name' => 'Щи',
                'coef' => '1',
            ],
            [
                'id' => '44',
                'name' => 'Маринованные огурцы',
                'coef' => '0.1',
            ],
            [
                'id' => '45',
                'name' => 'Окрошка',
                'coef' => '1',
            ],
            [
                'id' => '46',
                'name' => 'Панкейки',
                'coef' => '1',
            ],
            [
                'id' => '47',
                'name' => 'Малосольные огурцы',
                'coef' => '0.3',
            ],
            [
                'id' => '48',
                'name' => 'Солянка',
                'coef' => '0.56',
            ],
            [
                'id' => '49',
                'name' => 'Ассорти',
                'coef' => '0.5',
            ],
            [
                'id' => '50',
                'name' => 'Огурцы по-корейски',
                'coef' => '1',
            ],
            [
                'id' => '51',
                'name' => 'Торт',
                'coef' => '1',
            ],
            [
                'id' => '52',
                'name' => 'Кабачки по-корейски',
                'coef' => '1',
            ],
            [
                'id' => '53',
                'name' => 'Холодник',
                'coef' => '1',
            ],
            [
                'id' => '54',
                'name' => 'Соус',
                'coef' => '1',
            ],
            [
                'id' => '55',
                'name' => 'Конфитюр',
                'coef' => '0.85',
            ],
            [
                'id' => '60',
                'name' => 'Свекольник горячий',
                'coef' => '1',
            ],
            [
                'id' => '61',
                'name' => 'Заправка для борща',
                'coef' => '1',
            ],
            [
                'id' => '62',
                'name' => 'Маринованные помидоры',
                'coef' => '0.2',
            ],
            [
                'id' => '63',
                'name' => 'Омлет',
                'coef' => '1',
            ],
            [
                'id' => '64',
                'name' => 'Котлеты',
                'coef' => '1',
            ],
            [
                'id' => '65',
                'name' => 'Курица',
                'coef' => '1',
            ],
            [
                'id' => '66',
                'name' => 'Кабачки фаршированные',
                'coef' => '1',
            ],
            [
                'id' => '67',
                'name' => 'Кабачки в кляре',
                'coef' => '1',
            ],
            [
                'id' => '68',
                'name' => 'Рыба в кляре',
                'coef' => '1',
            ],
            [
                'id' => '69',
                'name' => 'Мясо',
                'coef' => '1',
            ],
            [
                'id' => '70',
                'name' => 'Тещин язык',
                'coef' => '1',
            ],
            [
                'id' => '71',
                'name' => 'Сацебели',
                'coef' => '1',
            ],
            [
                'id' => '72',
                'name' => 'Суфле',
                'coef' => '1',
            ],
            [
                'id' => '73',
                'name' => 'Кисель',
                'coef' => '1',
            ],
            [
                'id' => '74',
                'name' => 'Свинина',
                'coef' => '1',
            ],
            [
                'id' => '75',
                'name' => 'Борщ',
                'coef' => '1',
            ],
            [
                'id' => '76',
                'name' => 'Жареная картошка',
                'coef' => '1',
            ],
            [
                'id' => '77',
                'name' => 'Заливной пирог',
                'coef' => '1',
            ],
            [
                'id' => '78',
                'name' => 'Зебра',
                'coef' => '1',
            ],
            [
                'id' => '79',
                'name' => 'Малосольные помидоры',
                'coef' => '0.5',
            ],
            [
                'id' => '80',
                'name' => 'Кетчуп',
                'coef' => '0.35',
            ],
            [
                'id' => '81',
                'name' => 'Кабачковая икра',
                'coef' => '0.5',
            ],
            [
                'id' => '82',
                'name' => 'Аджика',
                'coef' => '0.65',
            ],
            [
                'id' => '83',
                'name' => 'Салат Охотничий',
                'coef' => '1',
            ],
            [
                'id' => '84',
                'name' => 'Анкл бенс',
                'coef' => '1',
            ],
            [
                'id' => '85',
                'name' => 'Чизкейк Нью-Йорк',
                'coef' => '1',
            ],
            [
                'id' => '86',
                'name' => 'Блины фаршированные',
                'coef' => '1.4',
            ],
            [
                'id' => '87',
                'name' => 'Блины тонкие',
                'coef' => '1.4',
            ],
            [
                'id' => '88',
                'name' => 'Блины с дырочками',
                'coef' => '1.4',
            ],
            [
                'id' => '89',
                'name' => 'Блины толстые',
                'coef' => '1.4',
            ],
            [
                'id' => '90',
                'name' => 'Красный крыжовник',
            ],
            [
                'id' => '91',
                'name' => 'Зеленый крыжовник',
            ],
            [
                'id' => '92',
                'name' => 'Грибы',
                'coef' => '1',
            ],
            [
                'id' => '95',
                'name' => 'Соленые помидоры',
                'coef' => '0.5',
            ],
            [
                'id' => '96',
                'name' => 'Квашеные помидоры',
                'coef' => '0.5',
            ],
            [
                'id' => '97',
                'name' => 'Ленивая лазанья',
                'coef' => '1',
            ],
            [
                'id' => '98',
                'name' => 'Лазанья бешамель',
                'coef' => '1',
            ],
            [
                'id' => '99',
                'name' => 'Лазанья болоньезе',
                'coef' => '1',
            ],
            [
                'id' => '100',
                'name' => 'Лазанья из слоеного теста',
                'coef' => '1',
            ],
            [
                'id' => '101',
                'name' => 'Вяленые помидоры',
                'coef' => '0.5',
            ],
            [
                'id' => '102',
                'name' => 'Помидоры по-корейски',
                'coef' => '0.5',
            ],
            [
                'id' => '103',
                'name' => 'Фаршированные помидоры',
                'coef' => '0.6',
            ],
            [
                'id' => '104',
                'name' => 'Гаспачо',
                'coef' => '0.5',
            ],
            [
                'id' => '105',
                'name' => 'Хачапури по-мегрельски',
                'coef' => '1',
            ],
            [
                'id' => '106',
                'name' => 'Хачапури по-аджарски',
                'coef' => '1',
            ],
            [
                'id' => '107',
                'name' => 'Хачапури по-имеретински',
                'coef' => '1',
            ],
            [
                'id' => '108',
                'name' => 'Ленивые хачапури',
                'coef' => '1',
            ],
            [
                'id' => '109',
                'name' => 'Хачапури из слоеного теста',
                'coef' => '1',
            ],
            [
                'id' => '110',
                'name' => 'Горячий салат',
                'coef' => '1',
            ],
            [
                'id' => '111',
                'name' => 'Закуска',
                'coef' => '1',
            ],
            [
                'id' => '112',
                'name' => 'Овощное рагу',
                'coef' => '1',
            ],
            [
                'id' => '113',
                'name' => 'Рагу',
                'coef' => '1',
            ],
            [
                'id' => '114',
                'name' => 'Вареники',
                'coef' => '1.45',
            ],
            [
                'id' => '115',
                'name' => 'Ленивые вареники',
                'coef' => '1',
            ],
            [
                'id' => '117',
                'name' => 'Варенье из Виктории',
                'coef' => '1',
            ],
            [
                'id' => '118',
                'name' => 'Соте',
                'coef' => '0.85',
            ],
            [
                'id' => '120',
                'name' => 'Грибы фаршированные',
                'coef' => '1',
            ],
            [
                'id' => '121',
                'name' => 'Щавель',
                'coef' => '1',
            ],
            [
                'id' => '122',
                'name' => 'Люля-кебаб',
                'coef' => '1',
            ],
            [
                'id' => '123',
                'name' => 'Лодочки из кабачков',
                'coef' => '0.7',
            ],
            [
                'id' => '124',
                'name' => 'Лодочки из баклажан',
                'coef' => '0.7',
            ],
            [
                'id' => '125',
                'name' => 'Баклажаны фаршированные',
                'coef' => '1',
            ],
            [
                'id' => '126',
                'name' => 'Перец',
                'coef' => '0.6',
            ],
            [
                'id' => '127',
                'name' => 'Перец фаршированный',
                'coef' => '1',
            ],
            [
                'id' => '128',
                'name' => 'Баклажаны по-корейски',
                'coef' => '1',
            ],
            [
                'id' => '129',
                'name' => 'Квас',
                'coef' => '0.2',
            ],
            [
                'id' => '130',
                'name' => 'Икра из баклажанов',
                'coef' => '0.5',
            ],
            [
                'id' => '131',
                'name' => 'Баклажаны',
                'coef' => '0.7',
            ],
            [
                'id' => '132',
                'name' => 'Кабачки',
                'coef' => '1',
            ],
            [
                'id' => '133',
                'name' => 'Баклажаны в аджике',
                'coef' => '1',
            ],
            [
                'id' => '135',
                'name' => 'Маринованные баклажаны',
                'coef' => '0.15',
            ],
            [
                'id' => '136',
                'name' => 'Баклажаны по-армянски',
                'coef' => '1',
            ],
            [
                'id' => '137',
                'name' => 'Баклажаны по-грузински',
                'coef' => '1',
            ],
            [
                'id' => '138',
                'name' => 'Квашеные баклажаны',
                'coef' => '1',
            ],
            [
                'id' => '139',
                'name' => 'Маринованные кабачки',
                'coef' => '0.15',
            ],
            [
                'id' => '140',
                'name' => 'Кабачки по-китайски',
                'coef' => '1',
            ],
            [
                'id' => '141',
                'name' => 'Кабачки по-болгарски',
                'coef' => '1',
            ],
            [
                'id' => '142',
                'name' => 'Маринованные патиссоны',
                'coef' => '1',
            ],
            [
                'id' => '143',
                'name' => 'Патиссоны',
                'coef' => '1',
            ],
            [
                'id' => '144',
                'name' => 'Маринованные грибы',
                'coef' => '0.1',
            ],
            [
                'id' => '145',
                'name' => 'Отварная картошка',
                'coef' => '1',
            ],
            [
                'id' => '146',
                'name' => 'Картофель',
                'coef' => '1',
            ],
            [
                'id' => '148',
                'name' => 'Насыпной пирог',
                'coef' => '1',
            ],
            [
                'id' => '149',
                'name' => 'Песочный пирог',
                'coef' => '1',
            ],
            [
                'id' => '150',
                'name' => 'Маринованный виноград',
                'coef' => '0.5',
            ],
            [
                'id' => '151',
                'name' => 'Виноград',
                'coef' => '1',
            ],
            [
                'id' => '152',
                'name' => 'Грибы соленые',
                'coef' => '1',
            ],
            [
                'id' => '153',
                'name' => 'Грибы жареные',
                'coef' => '1.1',
            ],
            [
                'id' => '154',
                'name' => 'Перец маринованный',
                'coef' => '0.7',
            ],
            [
                'id' => '156',
                'name' => 'Салат по-китайски',
                'coef' => '1',
            ],
            [
                'id' => '157',
                'name' => 'Салат Донской',
                'coef' => '1',
            ],
            [
                'id' => '158',
                'name' => 'Салат Аленка',
                'coef' => '1',
            ],
            [
                'id' => '159',
                'name' => 'Салат Осенний',
                'coef' => '1',
            ],
            [
                'id' => '160',
                'name' => 'Салат Дунайский',
                'coef' => '1',
            ],
            [
                'id' => '161',
                'name' => 'Салат Кубанский',
                'coef' => '1',
            ],
            [
                'id' => '162',
                'name' => 'Салат Пальчики оближешь',
                'coef' => '1',
            ],
            [
                'id' => '163',
                'name' => 'Маринованная морковь',
                'coef' => '0.65',
            ],
            [
                'id' => '164',
                'name' => 'Фанта',
                'coef' => '1',
            ],
            [
                'id' => '165',
                'name' => 'Картошка фри',
                'coef' => '1',
            ],
            [
                'id' => '166',
                'name' => 'Тушеная картошка',
                'coef' => '1',
            ],
            [
                'id' => '167',
                'name' => 'Свекла',
                'coef' => '0.32',
            ],
            [
                'id' => '168',
                'name' => 'Икра из свеклы',
                'coef' => '0.7',
            ],
            [
                'id' => '169',
                'name' => 'Паста',
                'coef' => '1',
            ],
            [
                'id' => '170',
                'name' => 'Грибы сушеные',
                'coef' => '0.5',
            ],
            [
                'id' => '171',
                'name' => 'Грибы в кляре',
                'coef' => '1',
            ],
            [
                'id' => '172',
                'name' => 'Грибы по-корейски',
                'coef' => '1',
            ],
            [
                'id' => '175',
                'name' => 'Скумбрия',
                'coef' => '1.8',
            ],
            [
                'id' => '176',
                'name' => 'Икра из моркови',
                'coef' => '1',
            ],
            [
                'id' => '177',
                'name' => 'Морковь',
                'coef' => '1',
            ],
            [
                'id' => '180',
                'name' => 'Зажарка',
                'coef' => '1',
            ],
            [
                'id' => '181',
                'name' => 'Пицца',
                'coef' => '1',
            ],
            [
                'id' => '182',
                'name' => 'Спагетти',
                'coef' => '0.9',
            ],
            [
                'id' => '183',
                'name' => 'Икра из грибов',
                'coef' => '0.8',
            ],
            [
                'id' => '184',
                'name' => 'Резаные помидоры',
                'coef' => '1',
            ],
            [
                'id' => '185',
                'name' => 'Помидоры в собственном соку',
                'coef' => '1',
            ],
            [
                'id' => '186',
                'name' => 'Помидоры половинками',
                'coef' => '1',
            ],
            [
                'id' => '187',
                'name' => 'Без кожицы',
                'coef' => '1',
            ],
            [
                'id' => '188',
                'name' => 'Помидоры в снегу',
                'coef' => '1',
            ],
            [
                'id' => '191',
                'name' => 'Соленые огурцы',
                'coef' => '0.3',
            ],
            [
                'id' => '192',
                'name' => 'Свекла по-корейски',
                'coef' => '0.32',
            ],
            [
                'id' => '193',
                'name' => 'Маринованная свекла',
                'coef' => '0.32',
            ],
            [
                'id' => '194',
                'name' => 'Маринованная капуста',
                'coef' => '1',
            ],
            [
                'id' => '195',
                'name' => 'Салат Неженский',
                'coef' => '1',
            ],
            [
                'id' => '196',
                'name' => 'Огурцы по-болгарски',
                'coef' => '1',
            ],
            [
                'id' => '197',
                'name' => 'Огурцы квашеные',
                'coef' => '1',
            ],
            [
                'id' => '198',
                'name' => 'Огурцы по-венгерски',
                'coef' => '1',
            ],
            [
                'id' => '199',
                'name' => 'Лимонная эссенция',
                'coef' => '1',
            ],
            [
                'id' => '201',
                'name' => 'Тушеные кабачки',
                'coef' => '1',
            ],
            [
                'id' => '203',
                'name' => 'Аджика зеленая',
                'coef' => '1',
            ],
            [
                'id' => '204',
                'name' => 'Аджика сухая',
                'coef' => '1',
            ],
            [
                'id' => '206',
                'name' => 'Тыквенный сок',
                'coef' => '0.3',
            ],
            [
                'id' => '207',
                'name' => 'Яблочный сок',
                'coef' => '0.3',
            ],
            [
                'id' => '208',
                'name' => 'Морковный сок',
                'coef' => '0.3',
            ],
            [
                'id' => '209',
                'name' => 'Томатный сок',
                'coef' => '0.3',
            ],
            [
                'id' => '210',
                'name' => 'Капкейки',
                'coef' => '1.48',
            ],
            [
                'id' => '211',
                'name' => 'Маффины',
                'coef' => '1.5',
            ],
            [
                'id' => '212',
                'name' => 'Баклажаны жареные',
                'coef' => '1',
            ],
            [
                'id' => '213',
                'name' => 'Красный бархат',
                'coef' => '1',
            ],
            [
                'id' => '214',
                'name' => 'Сок',
                'coef' => '0.3',
            ],
            [
                'id' => '215',
                'name' => 'Пюре',
                'coef' => '1',
            ],
            [
                'id' => '216',
                'name' => 'Томатная паста',
                'coef' => '0.5',
            ],
            [
                'id' => '217',
                'name' => 'Сок с мякотью',
                'coef' => '1',
            ],
            [
                'id' => '218',
                'name' => 'Варенье с целыми ягодами',
                'coef' => '1.3',
            ],
            [
                'id' => '219',
                'name' => 'Гуляш',
                'coef' => '1',
            ],
            [
                'id' => '220',
                'name' => 'Шницель',
                'coef' => '1',
            ],
            [
                'id' => '221',
                'name' => 'Ёжики',
                'coef' => '1',
            ],
            [
                'id' => '222',
                'name' => 'Гнезда',
                'coef' => '1',
            ],
            [
                'id' => '224',
                'name' => 'Лаваш',
                'coef' => '1',
            ],
            [
                'id' => '225',
                'name' => 'Треугольники из лаваша',
                'coef' => '1',
            ],
            [
                'id' => '226',
                'name' => 'Конвертики из лаваша',
                'coef' => '1.1',
            ],
            [
                'id' => '227',
                'name' => 'Ачма',
                'coef' => '1',
            ],
            [
                'id' => '228',
                'name' => 'Улитка из лаваша',
                'coef' => '1',
            ],
            [
                'id' => '229',
                'name' => 'Трубочки из лаваша',
                'coef' => '1',
            ],
            [
                'id' => '230',
                'name' => 'Пирожки из лаваша',
                'coef' => '1',
            ],
            [
                'id' => '231',
                'name' => 'Шаурма',
                'coef' => '1',
            ],
            [
                'id' => '232',
                'name' => 'Ролл из лаваша',
                'coef' => '1',
            ],
            [
                'id' => '233',
                'name' => 'Торт Наполеон',
                'coef' => '1',
            ],
            [
                'id' => '234',
                'name' => 'Сосиски',
                'coef' => '1',
            ],
            [
                'id' => '235',
                'name' => 'Бутерброд',
                'coef' => '1',
            ],
            [
                'id' => '236',
                'name' => 'Крем для торта',
                'coef' => '1.31',
            ],
            [
                'id' => '237',
                'name' => 'Белковый крем',
                'coef' => '1',
            ],
            [
                'id' => '238',
                'name' => 'Заварной крем',
                'coef' => '1',
            ],
            [
                'id' => '239',
                'name' => 'Крем для украшения торта',
                'coef' => '1',
            ],
            [
                'id' => '240',
                'name' => 'Крем для выравнивания торта',
                'coef' => '1',
            ],
            [
                'id' => '241',
                'name' => 'Торт Панчо',
                'coef' => '1',
            ],
            [
                'id' => '242',
                'name' => 'Торт Пломбир',
                'coef' => '1',
            ],
            [
                'id' => '243',
                'name' => 'Торт Шалаш',
                'coef' => '1',
            ],
            [
                'id' => '244',
                'name' => 'Торт Топленое молоко',
                'coef' => '1',
            ],
            [
                'id' => '245',
                'name' => 'Желейный торт',
                'coef' => '1',
            ],
            [
                'id' => '246',
                'name' => 'Крем для Наполеона',
                'coef' => '1',
            ],
            [
                'id' => '247',
                'name' => 'Крем для медовика',
                'coef' => '1',
            ],
            [
                'id' => '248',
                'name' => 'Крем для бисквитного торта',
                'coef' => '1',
            ],
            [
                'id' => '249',
                'name' => 'Крем Пломбир',
                'coef' => '1',
            ],
            [
                'id' => '250',
                'name' => 'Торт Муравейник',
                'coef' => '1',
            ],
            [
                'id' => '251',
                'name' => 'Крем чиз',
                'coef' => '1',
            ],
            [
                'id' => '252',
                'name' => 'Крем для капкейков',
                'coef' => '1',
            ],
            [
                'id' => '253',
                'name' => 'Крем для блинного торта',
                'coef' => '1',
            ],
            [
                'id' => '254',
                'name' => 'Крем Шарлотт',
                'coef' => '1',
            ],
            [
                'id' => '255',
                'name' => 'Крем ганаш',
                'coef' => '1',
            ],
            [
                'id' => '256',
                'name' => 'Паста карбонара',
                'coef' => '1.31',
            ],
            [
                'id' => '257',
                'name' => 'Тесто для пиццы',
                'coef' => '0.592',
            ],
            [
                'id' => '258',
                'name' => 'Тесто для чебуреков',
                'coef' => '0.76',
            ],
            [
                'id' => '259',
                'name' => 'Тесто для пирожков',
                'coef' => '0.74',
            ],
            [
                'id' => '260',
                'name' => 'Пирожки',
                'coef' => '1',
            ],
            [
                'id' => '261',
                'name' => 'Тесто на кыстыбый',
                'coef' => '0.71',
            ],
            [
                'id' => '262',
                'name' => 'Кыстыбый',
                'coef' => '1.12',
            ],
            [
                'id' => '263',
                'name' => 'Тесто для пельменей',
                'coef' => '0.71',
            ],
            [
                'id' => '264',
                'name' => 'Суп харчо',
                'coef' => '0.4',
            ],
            [
                'id' => '265',
                'name' => 'Суп шурпа',
                'coef' => '0.4',
            ],
            [
                'id' => '266',
                'name' => 'Лагман',
                'coef' => '1.1',
            ],
            [
                'id' => '267',
                'name' => 'Цыпленок табака',
                'coef' => '2',
            ],
            [
                'id' => '268',
                'name' => 'Шулюм',
                'coef' => '0.88',
            ],
            [
                'id' => '269',
                'name' => 'Крем-суп',
                'coef' => '0.4',
            ],
            [
                'id' => '270',
                'name' => 'Хлеб',
                'coef' => '0.95',
            ],
            [
                'id' => '271',
                'name' => 'Улитка из теста',
                'coef' => '1',
            ],
            [
                'id' => '272',
                'name' => 'Салат Обжорка',
                'coef' => '1',
            ],
            [
                'id' => '273',
                'name' => 'Салат Подсолнух',
                'coef' => '1',
            ],
            [
                'id' => '274',
                'name' => 'Соленая рыба',
                'coef' => '0.6',
            ],
            [
                'id' => '275',
                'name' => 'Тесто для курника',
                'coef' => '0.73',
            ],
            [
                'id' => '276',
                'name' => 'Тесто для вареников',
                'coef' => '0.71',
            ],
            [
                'id' => '277',
                'name' => 'Имбирные пряники',
                'coef' => '1.4',
            ],
            [
                'id' => '278',
                'name' => 'Курник',
                'coef' => '1',
            ],
            [
                'id' => '279',
                'name' => 'Пирог из слоеного теста',
                'coef' => '1',
            ],
            [
                'id' => '280',
                'name' => 'Булочки',
                'coef' => '1',
            ],
            [
                'id' => '281',
                'name' => 'Хашлама',
                'coef' => '1.123',
            ],
            [
                'id' => '282',
                'name' => 'Гусь',
                'coef' => '1.4',
            ],
            [
                'id' => '283',
                'name' => 'Бешбармак',
                'coef' => '1',
            ],
            [
                'id' => '284',
                'name' => 'Холодец',
                'coef' => '0.9',
            ],
            [
                'id' => '285',
                'name' => 'Кукурузная каша',
                'coef' => '0.55',
            ],
            [
                'id' => '286',
                'name' => 'Геркулесовая каша',
                'coef' => '0.54',
            ],
            [
                'id' => '287',
                'name' => 'Каша Дружба',
                'coef' => '0.56',
            ],
            [
                'id' => '288',
                'name' => 'Ячневая каша',
                'coef' => '0.58',
            ],
            [
                'id' => '289',
                'name' => 'Гороховая каша',
                'coef' => '0.53',
            ],
            [
                'id' => '290',
                'name' => 'Пшеничная каша',
                'coef' => '0.58',
            ],
            [
                'id' => '292',
                'name' => 'Тесто для беляшей',
                'coef' => '0.74',
            ],
            [
                'id' => '293',
                'name' => 'Тесто для вак-беляшей',
                'coef' => '0.73',
            ],
            [
                'id' => '294',
                'name' => 'Соленое сало',
                'coef' => '1',
            ],
            [
                'id' => '295',
                'name' => 'Соленое сало с мясной прослойкой',
                'coef' => '1',
            ],
            [
                'id' => '296',
                'name' => 'Маринованная скумбрия',
                'coef' => '0.8',
            ],
            [
                'id' => '297',
                'name' => 'Соленая икра',
                'coef' => '1',
            ],
            [
                'id' => '298',
                'name' => 'Слоеный салат',
            ],
            [
                'id' => '299',
                'name' => 'Жидкое тесто для пиццы',
                'coef' => '0.81',
            ],
            [
                'id' => '300',
                'name' => 'Заварное тесто',
                'coef' => '0.82',
            ],
            [
                'id' => '301',
                'name' => 'Утка',
                'coef' => '1.37',
            ],
            [
                'id' => '302',
                'name' => 'Чебуреки',
                'coef' => '1.06',
            ],
            [
                'id' => '303',
                'name' => 'Круассаны',
                'coef' => '1.23',
            ],
            [
                'id' => '304',
                'name' => 'Беляши',
                'coef' => '1',
            ],
            [
                'id' => '305',
                'name' => 'Вак-беляш',
                'coef' => '1',
            ],
            [
                'id' => '306',
                'name' => 'Конвертики из слоеного теста',
                'coef' => '1.1',
            ],
            [
                'id' => '307',
                'name' => 'Сосиски в тесте',
                'coef' => '1.13',
            ],
            [
                'id' => '308',
                'name' => 'Ватрушка',
                'coef' => '1.39',
            ],
            [
                'id' => '309',
                'name' => 'Королевская ватрушка',
                'coef' => '1.43',
            ],
            [
                'id' => '310',
                'name' => 'Плюшки',
                'coef' => '1.27',
            ],
            [
                'id' => '311',
                'name' => 'Гренки',
                'coef' => '1.61',
            ],
            [
                'id' => '312',
                'name' => 'Ханум',
                'coef' => '1.16',
            ],
            [
                'id' => '313',
                'name' => 'Лепешки',
                'coef' => '1',
            ],
            [
                'id' => '314',
                'name' => 'Молочные коржики',
                'coef' => '1.39',
            ],
            [
                'id' => '315',
                'name' => 'Самса',
                'coef' => '1.29',
            ],
            [
                'id' => '316',
                'name' => 'Самса из слоеного теста',
                'coef' => '1.28',
            ],
            [
                'id' => '317',
                'name' => 'Куриные крылышки',
                'coef' => '1.13',
            ],
            [
                'id' => '318',
                'name' => 'Куриная печень',
                'coef' => '1.18',
            ],
            [
                'id' => '319',
                'name' => 'Тесто для профитролей',
                'coef' => '0.74',
            ],
            [
                'id' => '320',
                'name' => 'Тесто для эклеров',
                'coef' => '0.77',
            ],
            [
                'id' => '321',
                'name' => 'Говядина',
                'coef' => '1',
            ],
            [
                'id' => '322',
                'name' => 'Цукаты',
            ],
            [
                'id' => '323',
                'name' => 'Кусочки тыквы',
                'coef' => '0.75',
            ],
            [
                'id' => '324',
                'name' => 'Индейка',
                'coef' => '1',
            ],
            [
                'id' => '325',
                'name' => 'Мясо по-французски',
                'coef' => '1',
            ],
            [
                'id' => '326',
                'name' => 'Закваска для хлеба',
                'coef' => '0.44',
            ],
            [
                'id' => '327',
                'name' => 'Суп с клецками',
                'coef' => '0.47',
            ],
            [
                'id' => '328',
                'name' => 'Клецки',
                'coef' => '0.76',
            ],
            [
                'id' => '329',
                'name' => 'Рогалики',
                'coef' => '1.43',
            ],
            [
                'id' => '330',
                'name' => 'Рогалики из слоеного теста',
                'coef' => '1.29',
            ],
            [
                'id' => '331',
                'name' => 'Коржи для торта',
                'coef' => '1.19',
            ],
            [
                'id' => '332',
                'name' => 'Картошка по-деревенски',
                'coef' => '1',
            ],
            [
                'id' => '333',
                'name' => 'Плов',
                'coef' => '0.96',
            ],
            [
                'id' => '334',
                'name' => 'Шах-плов',
                'coef' => '1',
            ],
            [
                'id' => '336',
                'name' => 'Ленивые беляши',
            ],
            [
                'id' => '337',
                'name' => 'Тесто для мантов',
                'coef' => '0.78',
            ],
            [
                'id' => '338',
                'name' => 'Стейк',
                'coef' => '0.598',
            ],
            [
                'id' => '339',
                'name' => 'Березовый сок',
                'coef' => '0.1',
            ],
            [
                'id' => '340',
                'name' => 'Шашлык',
                'coef' => '1',
            ],
            [
                'id' => '341',
                'name' => 'Маринад',
                'coef' => '0.8',
            ],
            [
                'id' => '342',
                'name' => 'Кальмары',
                'coef' => '1',
            ],
            [
                'id' => '343',
                'name' => 'Протертое варенье',
                'coef' => '1',
            ],
            [
                'id' => '344',
                'name' => 'Грудинка',
                'coef' => '1.17',
            ],
            [
                'id' => '345',
                'name' => 'Александрийский кулич',
                'coef' => '1',
            ],
            [
                'id' => '346',
                'name' => 'Слойка',
                'coef' => '1',
            ],
            [
                'id' => '347',
                'name' => 'Открытый пирог',
                'coef' => '1',
            ],
            [
                'id' => '350',
                'name' => 'Пасха',
                'coef' => '1',
            ],
            [
                'id' => '351',
                'name' => 'Смузи',
                'coef' => '1',
            ],
            [
                'id' => '352',
                'name' => 'Коктейль',
                'coef' => '1',
            ],
            [
                'id' => '353',
                'name' => 'Глазурь для кулича',
                'coef' => '0.51',
            ],
            [
                'id' => '354',
                'name' => 'Александрийское тесто',
                'coef' => '0.79',
            ],
            [
                'id' => '355',
                'name' => 'Кулич на опаре',
                'coef' => '0.8',
            ],
            [
                'id' => '356',
                'name' => 'Заварная пасха',
                'coef' => '1',
            ],
            [
                'id' => '357',
                'name' => 'Заварная глазурь для кулича',
                'coef' => '1',
            ],
            [
                'id' => '358',
                'name' => 'Апельсины',
                'coef' => '1',
            ],
            [
                'id' => '359',
                'name' => 'Сырники',
            ],
            [
                'id' => '360',
                'name' => 'Арбуз',
                'coef' => '1',
            ],
            [
                'id' => '361',
                'name' => 'Алыча',
                'coef' => '1',
            ],
            [
                'id' => '363',
                'name' => 'Рубленные котлеты',
            ],
            [
                'id' => '364',
                'name' => 'Котлеты из фарша',
            ],
            [
                'id' => '365',
                'name' => 'Котлеты по-киевски',
            ],
            [
                'id' => '366',
                'name' => 'Клубника',
                'coef' => '1',
            ],
            [
                'id' => '367',
                'name' => 'Сок из черной смородины',
                'coef' => '1',
            ],
            [
                'id' => '368',
                'name' => 'Вишневый сок',
                'coef' => '1',
            ],
            [
                'id' => '369',
                'name' => 'Квашеная капуста',
            ],
            [
                'id' => '370',
                'name' => 'Огурцы по-польски',
            ],
            [
                'id' => '371',
                'name' => 'Жареные помидоры',
                'coef' => '1',
            ],
            [
                'id' => '372',
                'name' => 'Помидоры по-армянски',
            ],
            [
                'id' => '373',
                'name' => 'Манная каша',
            ],
            [
                'id' => '374',
                'name' => 'Помидоры',
            ],
            [
                'id' => '375',
                'name' => 'Шампиньоны',
            ],
            [
                'id' => '377',
                'name' => 'Лечо',
            ],
            [
                'id' => '378',
                'name' => 'Тесто',
            ],
            [
                'id' => '379',
                'name' => 'Тесто для пирога',
            ],
            [
                'id' => '380',
                'name' => 'Тесто для заливного пирога',
            ],
            [
                'id' => '381',
                'name' => 'Каша',
            ],
            [
                'id' => '382',
                'name' => 'Эклер',
            ],
            [
                'id' => '383',
                'name' => 'Картошка',
            ],
            [
                'id' => '384',
                'name' => 'Кабачк',
            ],
            [
                'id' => '385',
                'name' => 'Жаркое',
            ],
            [
                'id' => '386',
                'name' => 'Кляр для рыбы',
                'coef' => '1',
            ],
            [
                'id' => '387',
                'name' => 'Драники',
            ],
            [
                'id' => '388',
                'name' => 'Домашний сыр',
            ],
            [
                'id' => '389',
                'name' => 'Печенье',
            ],
            [
                'id' => '390',
                'name' => 'Уха',
            ],
            [
                'id' => '391',
                'name' => 'Салат Мимоза',
            ],
            [
                'id' => '392',
                'name' => 'Пирожное',
            ],
            [
                'id' => '393',
                'name' => 'Трайфл',
            ],
            [
                'id' => '394',
                'name' => 'Синнабоны',
            ],
            [
                'id' => '395',
                'name' => 'Тирамису',
            ],
            [
                'id' => '396',
                'name' => 'Гречневая каша',
            ],
            [
                'id' => '397',
                'name' => 'Майонез',
            ],
            [
                'id' => '398',
                'name' => 'Чахохбили',
            ],
            [
                'id' => '399',
                'name' => 'Тефтели',
            ],
            [
                'id' => '400',
                'name' => 'Паштет',
            ],
            [
                'id' => '401',
                'name' => 'Горчица',
            ],
            [
                'id' => '402',
                'name' => 'Оливье',
            ],
            [
                'id' => '403',
                'name' => 'Бургер',
            ],
            [
                'id' => '404',
                'name' => 'Бефстроганов',
            ],
            [
                'id' => '405',
                'name' => 'Селедка под шубой',
            ],
            [
                'id' => '406',
                'name' => 'Вафли',
            ],
            [
                'id' => '407',
                'name' => 'Винегрет',
            ],
            [
                'id' => '408',
                'name' => 'Торт Черепаха',
            ],
            [
                'id' => '409',
                'name' => 'Шоколадная колбаса',
            ],
            [
                'id' => '410',
                'name' => 'Форшмак',
            ],
            [
                'id' => '411',
                'name' => 'Салат Гнездо глухаря',
            ],
            [
                'id' => '412',
                'name' => 'Салат Гранатовый браслет',
            ],
            [
                'id' => '413',
                'name' => 'Салат Тбилиси',
            ],
            [
                'id' => '414',
                'name' => 'Рыба под маринадом',
            ],
            [
                'id' => '415',
                'name' => 'Макароны по-флотски',
            ],
            [
                'id' => '416',
                'name' => 'Рулька',
            ],
            [
                'id' => '417',
                'name' => 'Том ям',
            ],
            [
                'id' => '418',
                'name' => 'Сациви',
            ],
            [
                'id' => '419',
                'name' => 'Салат Столичный',
            ],
            [
                'id' => '420',
                'name' => 'Гуакамоле',
            ],
            [
                'id' => '421',
                'name' => 'Штрудель',
            ],
            [
                'id' => '422',
                'name' => 'Бигус',
            ],
            [
                'id' => '423',
                'name' => 'Сочник',
            ],
            [
                'id' => '424',
                'name' => 'Луковый суп',
            ],
            [
                'id' => '425',
                'name' => 'Ризотто',
            ],
            [
                'id' => '426',
                'name' => 'Пончики',
            ],
            [
                'id' => '427',
                'name' => 'Торт Молочная девочка',
            ],
            [
                'id' => '428',
                'name' => 'Брауни',
            ],
            [
                'id' => '429',
                'name' => 'Торт Прага',
            ],
            [
                'id' => '430',
                'name' => 'Панакота',
            ],
            [
                'id' => '431',
                'name' => 'Вафельные трубочки',
            ],
            [
                'id' => '432',
                'name' => 'Кулебяка',
            ],
            [
                'id' => '433',
                'name' => 'Селедочное масло',
            ],
            [
                'id' => '434',
                'name' => 'Рататуй',
            ],
            [
                'id' => '435',
                'name' => 'Профитроли',
            ],
            [
                'id' => '436',
                'name' => 'Паэлья',
            ],
            [
                'id' => '437',
                'name' => 'Торт Рыжик',
            ],
            [
                'id' => '438',
                'name' => 'Яичница',
            ],
            [
                'id' => '439',
                'name' => 'Биточки',
            ],
            [
                'id' => '440',
                'name' => 'Соус для шашлыка',
            ],
            [
                'id' => '441',
                'name' => 'Маринованный лук',
            ],
            [
                'id' => '442',
                'name' => 'Зразы',
            ],
            [
                'id' => '443',
                'name' => 'Тушеная капуста',
            ],
            [
                'id' => '444',
                'name' => 'Кулеш',
            ],
            [
                'id' => '445',
                'name' => 'Фрикадельки',
            ],
            [
                'id' => '446',
                'name' => 'Фетучини',
            ],
            [
                'id' => '447',
                'name' => 'Макароны',
            ],
            [
                'id' => '448',
                'name' => 'Творожные шарики',
            ],
            [
                'id' => '449',
                'name' => 'Сельдь',
            ],
            [
                'id' => '450',
                'name' => 'Салат Шапка Мономаха',
            ],
            [
                'id' => '451',
                'name' => 'Салат Мужские грёзы',
            ],
            [
                'id' => '452',
                'name' => 'Чанахи',
            ],
            [
                'id' => '453',
                'name' => 'Шакшука',
            ],
            [
                'id' => '454',
                'name' => 'Фрикасе',
            ],
            [
                'id' => '455',
                'name' => 'Тортилья',
            ],
            [
                'id' => '456',
                'name' => 'Рулетики',
            ],
            [
                'id' => '457',
                'name' => 'Гратен',
            ],
            [
                'id' => '458',
                'name' => 'Овсяноблин',
            ],
            [
                'id' => '459',
                'name' => 'Стожки',
            ],
            [
                'id' => '460',
                'name' => 'Лобио',
            ],
            [
                'id' => '461',
                'name' => 'Баранина',
            ],
            [
                'id' => '462',
                'name' => 'Манты',
            ],
            [
                'id' => '463',
                'name' => 'Макаруны',
            ],
            [
                'id' => '464',
                'name' => 'Моти',
            ],
            [
                'id' => '465',
                'name' => 'Яйца Бенедикт',
            ],
            [
                'id' => '466',
                'name' => 'Хе по-корейски',
            ],
            [
                'id' => '467',
                'name' => 'Штрудли',
            ],
            [
                'id' => '468',
                'name' => 'Теплый салат',
            ],
            [
                'id' => '469',
                'name' => 'Пастила',
            ],
            [
                'id' => '470',
                'name' => 'Мамалыга',
            ],
            [
                'id' => '471',
                'name' => 'Лавшевник',
            ],
            [
                'id' => '472',
                'name' => 'Пряники',
            ],
            [
                'id' => '473',
                'name' => 'Хычины',
            ],
            [
                'id' => '474',
                'name' => 'Кускус',
            ],
            [
                'id' => '475',
                'name' => 'Гречаники',
            ],
            [
                'id' => '476',
                'name' => 'Шаньги',
            ],
            [
                'id' => '477',
                'name' => 'Горячий шоколад',
            ],
            [
                'id' => '478',
                'name' => 'Булгур',
            ],
            [
                'id' => '479',
                'name' => 'Сырные палочки',
            ],
            [
                'id' => '480',
                'name' => 'Закусочный торт',
            ],
            [
                'id' => '481',
                'name' => 'Манные биточки',
            ],
            [
                'id' => '482',
                'name' => 'Бризоль',
            ],
            [
                'id' => '483',
                'name' => 'Судугай',
            ],
            [
                'id' => '484',
                'name' => 'Маринованная рыба',
            ],
            [
                'id' => '485',
                'name' => 'Конфеты',
            ],
            [
                'id' => '486',
                'name' => 'Свиные уши',
            ],
            [
                'id' => '487',
                'name' => 'Ветчина',
            ],
            [
                'id' => '488',
                'name' => 'Суши',
            ],
            [
                'id' => '489',
                'name' => 'Мед',
            ],
            [
                'id' => '490',
                'name' => 'Десерт',
            ],
            [
                'id' => '491',
                'name' => 'Куриные сердечки',
            ],
            [
                'id' => '492',
                'name' => 'Начинка для пирожков',
            ],
            [
                'id' => '493',
                'name' => 'Тесто для булочек',
            ],
            [
                'id' => '494',
                'name' => 'Мясной хлеб',
            ],
            [
                'id' => '495',
                'name' => 'Баранки',
            ],
            [
                'id' => '496',
                'name' => 'Сухарики',
            ],
            [
                'id' => '497',
                'name' => 'Куриные ножки',
            ],
            [
                'id' => '498',
                'name' => 'Пельмени',
            ],
            [
                'id' => '499',
                'name' => 'Рис',
            ],
            [
                'id' => '500',
                'name' => 'Креветки',
            ],
            [
                'id' => '501',
                'name' => 'Тесто для сосисок в тесте',
            ],
            [
                'id' => '502',
                'name' => 'Говяжья печень',
            ],
            [
                'id' => '503',
                'name' => 'Пастрома',
            ],
            [
                'id' => '504',
                'name' => 'Куриные бедра',
            ],
            [
                'id' => '505',
                'name' => 'Сальтисон',
            ],
            [
                'id' => '506',
                'name' => 'Закваска для кваса',
            ],
            [
                'id' => '507',
                'name' => 'Элеш',
            ],
            [
                'id' => '508',
                'name' => 'Пышки',
            ],
            [
                'id' => '509',
                'name' => 'Картофельные шарики',
            ],
            [
                'id' => '510',
                'name' => 'Цветная капуста',
            ],
            [
                'id' => '511',
                'name' => 'Печеные яблоки',
            ],
            [
                'id' => '512',
                'name' => 'Куриные желудки',
            ],
            [
                'id' => '513',
                'name' => 'Буженина',
            ],
            [
                'id' => '514',
                'name' => 'Капуста',
            ],
            [
                'id' => '515',
                'name' => 'Ужин',
            ],
            [
                'id' => '516',
                'name' => 'Фаршированные шампиньоны',
            ],
            [
                'id' => '517',
                'name' => 'Слоеные язычки',
            ],
            [
                'id' => '518',
                'name' => 'Колдуны',
            ],
            [
                'id' => '519',
                'name' => 'Колбаса',
            ],
            [
                'id' => '520',
                'name' => 'Сироп',
            ],
            [
                'id' => '521',
                'name' => 'Рисовая каша',
            ],
            [
                'id' => '522',
                'name' => 'Мидии',
            ],
            [
                'id' => '523',
                'name' => 'Глазурь',
            ],
            [
                'id' => '524',
                'name' => 'Лапша домашняя',
            ],
            [
                'id' => '525',
                'name' => 'Эчпочмак',
            ],
            [
                'id' => '526',
                'name' => 'Соба',
            ],
            [
                'id' => '527',
                'name' => 'Кролик',
            ],
            [
                'id' => '528',
                'name' => 'Лимонад',
            ],
            [
                'id' => '529',
                'name' => 'Поджарка',
            ],
            [
                'id' => '530',
                'name' => 'Консервы',
            ],
            [
                'id' => '531',
                'name' => 'Конфи для торта',
            ],
            [
                'id' => '532',
                'name' => 'Пеламуши',
            ],
            [
                'id' => '533',
                'name' => 'Чашушули',
            ],
            [
                'id' => '534',
                'name' => 'Жареный сыр',
            ],
            [
                'id' => '535',
                'name' => 'Тарталетки',
            ],
            [
                'id' => '536',
                'name' => 'Коктейль безалкогольный',
            ],
            [
                'id' => '537',
                'name' => 'Слойки',
            ],
            [
                'id' => '538',
                'name' => 'Рамен',
            ],
            [
                'id' => '539',
                'name' => 'Глазированные сырки',
            ],
            [
                'id' => '540',
                'name' => 'Свиная печень',
            ],
            [
                'id' => '541',
                'name' => 'Перловая каша',
            ],
            [
                'id' => '542',
                'name' => 'Корзинки',
            ],
            [
                'id' => '543',
                'name' => 'Коврижка',
            ],
            [
                'id' => '544',
                'name' => 'Пирожное картошка',
            ],
        ];

        foreach ($cooks as $cook) {
            Cook::create($cook);
        }
    }
}
