<?php

namespace Database\Seeders;

use App\Models\Kitchen;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class KitchenSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $kitchens = [
            [
                'id' => '1',
                'name' => 'Русская',
            ],
            [
                'id' => '2',
                'name' => 'Итальянская',
            ],
            [
                'id' => '3',
                'name' => 'Американская',
            ],
            [
                'id' => '4',
                'name' => 'Греческая',
            ],
            [
                'id' => '5',
                'name' => 'Французская',
            ],
            [
                'id' => '6',
                'name' => 'Европейская',
            ],
            [
                'id' => '7',
                'name' => 'Грузинская',
            ],
            [
                'id' => '8',
                'name' => 'Азиатская',
            ],
            [
                'id' => '10',
                'name' => 'Украинская',
            ],
            [
                'id' => '11',
                'name' => 'Белорусская',
            ],
            [
                'id' => '12',
                'name' => 'Немецкая',
            ],
            [
                'id' => '13',
                'name' => 'Венгерская',
            ],
            [
                'id' => '14',
                'name' => 'Болгарская',
            ],
            [
                'id' => '15',
                'name' => 'Польская',
            ],
            [
                'id' => '16',
                'name' => 'Восточно-европейская',
            ],
            [
                'id' => '17',
                'name' => 'Литовская',
            ],
            [
                'id' => '18',
                'name' => 'Армянская',
            ],
            [
                'id' => '19',
                'name' => 'Мировая',
            ],
            [
                'id' => '20',
                'name' => 'Азербайджанская',
            ],
            [
                'id' => '21',
                'name' => 'Кавказская',
            ],
            [
                'id' => '22',
                'name' => 'Молдавская',
            ],
            [
                'id' => '23',
                'name' => 'Испанская',
            ],
            [
                'id' => '24',
                'name' => 'Узбекская',
            ],
            [
                'id' => '25',
                'name' => 'Восточноевропейская',
            ],
            [
                'id' => '26',
                'name' => 'Татарская',
            ],
            [
                'id' => '27',
                'name' => 'Восточная',
            ],
            [
                'id' => '28',
                'name' => 'Среднеазиатская',
            ],
            [
                'id' => '29',
                'name' => 'Ирландская',
            ],
            [
                'id' => '30',
                'name' => 'Казахская',
            ],
            [
                'id' => '31',
                'name' => 'Киргизская',
            ],
            [
                'id' => '33',
                'name' => 'Японская',
            ],
            [
                'id' => '34',
                'name' => 'Китайская',
            ],
            [
                'id' => '35',
                'name' => 'Корейская',
            ],
            [
                'id' => '36',
                'name' => 'Шведская',
            ],
            [
                'id' => '37',
                'name' => 'Еврейская',
            ],
            [
                'id' => '38',
                'name' => 'Осетинская',
            ],
            [
                'id' => '39',
                'name' => 'Шотландская',
            ],
            [
                'id' => '40',
                'name' => 'Башкирская',
            ],
            [
                'id' => '41',
                'name' => 'Английская',
            ],
            [
                'id' => '42',
                'name' => 'Арабская',
            ],
            [
                'id' => '43',
                'name' => 'Турецкая',
            ],
            [
                'id' => '44',
                'name' => 'Ливанская',
            ],
            [
                'id' => '45',
                'name' => 'Австралийская',
            ],
            [
                'id' => '46',
                'name' => 'Советская',
            ],
            [
                'id' => '47',
                'name' => 'Восточнославянская',
            ],
            [
                'id' => '48',
                'name' => 'Мексиканская ',
            ],
            [
                'id' => '49',
                'name' => 'Австрийская',
            ],
            [
                'id' => '50',
                'name' => 'Крымско-татарская',
            ],
            [
                'id' => '51',
                'name' => 'Швейцарская',
            ],
            [
                'id' => '52',
                'name' => ' Средиземноморская',
            ],
            [
                'id' => '53',
                'name' => 'Средиземноморская',
            ],
            [
                'id' => '54',
                'name' => 'Вьетнамская',
            ],
            [
                'id' => '55',
                'name' => 'Карачаево-балкарская',
            ],
            [
                'id' => '56',
                'name' => 'Магрибская',
            ],
            [
                'id' => '57',
                'name' => 'Финская',
            ],
            [
                'id' => '58',
                'name' => 'Скандинавская',
            ],
            [
                'id' => '59',
                'name' => 'Тайская',
            ],
            [
                'id' => '60',
                'name' => 'Латвийская',
            ],
            [
                'id' => '61',
                'name' => 'Латвийска',
            ],
            [
                'id' => '62',
                'name' => 'Фьюжен',
            ],
        ];

        foreach ($kitchens as $kitchen) {
            Kitchen::create($kitchen);
        }
    }
}
