<?php

namespace Database\Seeders;

use App\Models\Norm;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class NormSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $norms = [
            [
                'id' => '728',
                'name' => 'Витамин A, мкг',
                'value' => '900',
            ],
            [
                'id' => '729',
                'name' => 'Витамин В1, мг',
                'value' => '1.5',
            ],
            [
                'id' => '730',
                'name' => 'Витамин В2, мг',
                'value' => '1.8',
            ],
            [
                'id' => '731',
                'name' => 'Витамин В4, мг',
                'value' => '500',
            ],
            [
                'id' => '732',
                'name' => 'Витамин В5, мг',
                'value' => '5',
            ],
            [
                'id' => '733',
                'name' => 'Витамин В6, мг',
                'value' => '2',
            ],
            [
                'id' => '734',
                'name' => 'Витамин В9, мкг',
                'value' => '400',
            ],
            [
                'id' => '735',
                'name' => 'Витамин В12, мкг',
                'value' => '3',
            ],
            [
                'id' => '736',
                'name' => 'Витамин С, мкг',
                'value' => '90',
            ],
            [
                'id' => '737',
                'name' => 'Витамин D, мкг',
                'value' => '10',
            ],
            [
                'id' => '738',
                'name' => 'Витамин E, мг',
                'value' => '15',
            ],
            [
                'id' => '739',
                'name' => 'Биотин, мг',
                'value' => '50',
            ],
            [
                'id' => '740',
                'name' => 'Витамин К, мкг',
                'value' => '120',
            ],
            [
                'id' => '741',
                'name' => 'Витамин РР, мг',
                'value' => '20',
            ],
            [
                'id' => '742',
                'name' => 'Калий, мг',
                'value' => '2500',
            ],
            [
                'id' => '743',
                'name' => 'Кальций, мг',
                'value' => '1000',
            ],
            [
                'id' => '744',
                'name' => 'Кремний, мг',
                'value' => '30',
            ],
            [
                'id' => '745',
                'name' => 'Магний, мг',
                'value' => '400',
            ],
            [
                'id' => '746',
                'name' => 'Натрий, мг',
                'value' => '1300',
            ],
            [
                'id' => '747',
                'name' => 'Сера, мг',
                'value' => '500',
            ],
            [
                'id' => '748',
                'name' => 'Фосфор, мг',
                'value' => '800',
            ],
            [
                'id' => '749',
                'name' => 'Хлор, мг',
                'value' => '2300',
            ],
            [
                'id' => '750',
                'name' => 'Алюминий, мкг',
                'value' => '30',
            ],
            [
                'id' => '751',
                'name' => 'Железо, мг',
                'value' => '18',
            ],
            [
                'id' => '752',
                'name' => 'Йод, мкг',
                'value' => '150',
            ],
            [
                'id' => '753',
                'name' => 'Кобальт, мкг',
                'value' => '10',
            ],
            [
                'id' => '754',
                'name' => 'Литий, мкг',
                'value' => '70',
            ],
            [
                'id' => '755',
                'name' => 'Марганец, мкг',
                'value' => '2',
            ],
            [
                'id' => '756',
                'name' => 'Медь, мкг',
                'value' => '1000',
            ],
            [
                'id' => '757',
                'name' => 'Никель, мкг',
                'value' => '200',
            ],
            [
                'id' => '758',
                'name' => 'Рубидий, мкг',
                'value' => '200',
            ],
            [
                'id' => '759',
                'name' => 'Селен, мкг',
                'value' => '55',
            ],
            [
                'id' => '760',
                'name' => 'Фтор, мкг',
                'value' => '4000',
            ],
            [
                'id' => '761',
                'name' => 'Хром, мкг',
                'value' => '50',
            ],
            [
                'id' => '762',
                'name' => 'Цинк, мг',
                'value' => '12',
            ],
            [
                'id' => '763',
                'name' => 'Бор, мкг',
                'value' => '1200',
            ],
            [
                'id' => '764',
                'name' => 'Ванадий, мкг',
                'value' => '20',
            ],
            [
                'id' => '765',
                'name' => 'Молибден, мкг',
                'value' => '70',
            ],
        ];

        foreach ($norms as $norm){
            Norm::create($norm);
        }
    }
}
